Written By: Hafiz Waleed Ahmad\
Email: waleedrajpoot5657@gmail.com\
Title: Data Merging

In [3]:
# import libraries
import pandas as pd

# Example dataset for data merging
# dataset 1: pakistani individuals
data1 = {
    'id': [1, 2, 3,],
    'name': ['Ali', 'Ahmed', 'Sara'],
    'age': [20, 25, 22]}

df1 = pd.DataFrame(data1)
df1.head()

   id   name  age
0   1    Ali   20
1   2  Ahmed   25
2   3   Sara   22

In [7]:

# dataset 2: Additional information
data2 = {
    'id': [1, 2, 3],
    'city': ['Karachi', 'Lahore', 'Islamabad'],
    'ocupation': ['Engineer', 'Doctor', 'Teacher']}

df2 = pd.DataFrame(data2)
df2.head()

   id       city ocupation
0   1    Karachi  Engineer
1   2     Lahore    Doctor
2   3  Islamabad   Teacher

In [8]:
# merging dataframoe on id
merge_df = pd.merge(df1, df2, on='id', how='inner')
merge_df

   id   name  age       city ocupation
0   1    Ali   20    Karachi  Engineer
1   2  Ahmed   25     Lahore    Doctor
2   3   Sara   22  Islamabad   Teacher

#  ***Data Concatination***

In [9]:
# import libraries
import pandas as pd

# Example datset for data concatination
# Dataset 1: pakistani names and ages
data1 = { 'name': ['Ali', 'Ahmed', 'Sara', 'Saliha', ], 'age': [20, 21, 19, 22]}

# Dataset 2: More pakistani names and ages
data2 = { 'name': [ 'Hamza', 'Bilal', 'Nimra', 'Fatima'], 'age': [27, 26, 16, 24]}

# Dataset 3: cities and provinces in Pakistan
data3 = { 'city': ['Karachi', 'Lahore', 'Islamabad', 'Quetta'], 'province': ['Sindh', 'Punjab', 'Punjab', 'Balochistan']}

# Create dataframes
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)


# concatinating rows
concatenated_rows = pd.concat([df1, df2])

# concatinating columns
# for a meaningfull column wise concatination, we need to have a common column in both dataframes
concatinated_columns = pd.concat([df1, df3], axis=1)

print(concatenated_rows)
print('---------------------------------')
print(concatinated_columns)

     name  age
0     Ali   20
1   Ahmed   21
2    Sara   19
3  Saliha   22
0   Hamza   27
1   Bilal   26
2   Nimra   16
3  Fatima   24
---------------------------------
     name  age       city     province
0     Ali   20    Karachi        Sindh
1   Ahmed   21     Lahore       Punjab
2    Sara   19  Islamabad       Punjab
3  Saliha   22     Quetta  Balochistan